{
  "Installer": [
    {
      "Architecture": "x86",
      "InstallerUrl": "https://download.sweetscape.com/010EditorWin32Installer14.0.exe"
    },
    {
      "Architecture": "x64",
      "InstallerUrl": "https://download.sweetscape.com/010EditorWin64Installer14.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "The following is an overview of the new functionality in version 14.0 of 010 Editor:\n- The caret is now easier to see and displays as a flashing vertical line in insert mode and an underscore in overwrite mode.\n- Template Results has a new style and the Type information has been moved to a separate column.\n- Tables now display without grid lines and have better shortcut key support.\n- Templates can use styles to apply colors to variables using the syntax <style=???> after a variable.\n- Placing the mouse cursor over the hex editor now shows an outline around the struct the mouse is over (struct outlining).\n- Can set a custom application scale factor in the General Options dialog.\n- Auto-Indent is supported in the Text Editor.\n- Added a Support Forum link to the Help menu.\nThe following is a list of all new features in version 14.0 of 010 Editor:\n- Improved Caret\n- Caret has a different style and is easier to see.\n- A vertical line is shown in insert mode and an underscore line is shown in overwrite mode.\n- The Caret can be configured using the Editor Options dialog. Different thicknesses or a block cursor can be chosen.\n- Animation and height of the caret can be controlled.\n- When the editor is inactive the caret is now drawn transparent.\n- Template Results\n- New style for the Template Results.\n- Type information has been moved to a separate Type column.\n- See the Tables section below for a list of other changes to the Template Results.\n- The Color column now draws background colors in a box and if a foreground color exists it is drawn as the word Text.\n- Better keyboard shortcut keys as described in the Tables section below.\n- Reordered some items on the right-click menu.\n- On the right-click menu, Start Addresses menu is moved to Column Display Format > Start Column.\n- Can hide the Type column using Column Display Format > Type Column.\n- Open nodes in the Templates Results are drawn with a highlighted text color.\n- Using View > Font > Enlarge Font/Shrink Font will now affect the Template Results if the Template Results is focused.\n- The Variables tab now uses the same font as the Template Results font (was using the Inspector font).\n- The caret in the Hex Editor is now hidden when a row in the Template Results is selected.\n- Using View > Template Results while editing a Template now shows or hides the Template Results of the target edit file.\n- Tables\n- New style for all Tables including the Find Results, Template Results, Bookmarks, Compare Results, etc.\n- Grid lines have been removed and rows highlight on mouse-over.\n- Can right-click on the Table Header to access the Column Display Format menu for each column.\n- Tables now select by rows instead of by cells.\n- Pressing the Left or Right keys opens or closes nodes instead of moving the cell selector.\n- The Home/End keys can be used to select the first or last row in the table.\n- Use the Enter key to edit an item or toggle open/close status if the node cannot be edited.\n- The Copy menu on the right-click menu now lists each column that can be copied.\n- Copy Row is the now the default for Ctrl+C when selecting by rows.\n- Renamed Copy Table to Copy All.\n- The Column Display Format menu now lists each column that can be modified.\n- Can switch back to selecting by cells by right-clicking on a Table and selecting Column Display Format > Select by > Cells.\n- Grid lines can be added back using the Theme/Colors Options dialog.\n- Struct Outlining\n- Placing the mouse cursor over the hex editor now shows an outline around the struct the mouse is over.\n- The variable the cursor is over is now highlighted in a different background color.\n- Older system of showing brackets around variables has been removed but can be re-enabled using the Theme/Colors Options dialog.\n- The colors of the outlining and variable highlighting can be controlled using the Theme/Colors Options dialog.\n- The current struct is also highlighted in the MiniMap.\n- Outlining can be turned off with the Hex Editor Options dialog.\n- Mini Map\n- When the mouse cursor is over a struct in the hex editor, the struct is now shown as highlighted in the Mini Map.\n- Highlighting structs can be turned off using the Mini Map Options dialog.\n- The color of the highlighting can be adjusted using the Theme/Colors Options dialog.\n- Template Styles\n- Templates can apply colors to variables using the syntax <style=???> after a variable.\n- Styles provide a consistent set of colors that work on both light and dark themes.\n- Using style is preferable to fgcolor and bgcolor if the Template is to be shared with other people.\n- Default styles include sHeading1, sHeading2, sHeading3, sHeading4, sSection1, sSection2, sSection3, sSection4, sMarker, and sData.\n- Each style has an accent color (e.g. sHeading1Accent) that can be used to color important variables within a struct.\n- Template Style colors can be modified with the Theme/Colors Options dialog.\n- Added built-in functions GetStyle, SetStyle, GetStyleBackColor and GetStyleForeColor to Templates.\n- Text Editor\n- Can set the spacing between lines with View > Font > Set Line Spacing.\n- Changed the word wrap indicator from '-' to a blue down-arrow displayed in the left-most column.\n- Can adjust the word wrap symbol in Text Editor Options and the color in Theme/Colors Options.\n- Pressing left when a selection is made jumps to the beginning of the selection.\n- Hex Editor\n- Changed the style of the hex editor to be more simplified.\n- The hex editor can now show lowercase hex.\n- When left clicking on the hex editor, an improved algorithm is used to determine the character that was clicked.\n- The number of digits in addresses stays constant when scrolling through files.\n- Removed 'h' and ':' after addresses.\n- Added more control over how addresses are displayed using the Hex Editor Options dialog.\n- The current line is now highlighted by overlaying colors using blending.\n- The current line is only highlighted when no bytes are selected.\n- The line width of the hex editor can be set per file by unchecking View > Line Width > Use Default Line Width.\n- Application Scale Factor\n- Can now set a custom application scale factor in the General Options dialog.\n- If multiple monitors are connected then scaling can be set for each monitor.\n- Requires restarting the application when scale factors are changed.\n- Auto-Indent\n- Pressing Enter on a line in the text editor that is indented will automatically add spaces to the newly created line.\n- Auto-indent can be turned off by clicking View > Code Intelligence > Auto-Indent.\n- Pressing the Backspace key immediately after Enter will delete spaces by the Indent Size.\n- When editing C/C++ or an 010 Editor Template or Script, if a line ends with '{' or '(' then pressing Enter indents the line further.\n- When editing Python and a line ends with ':' then pressing Enter indents the line further.\n- The Auto-Indent setting is stored with the current Edit As.\n- Licensing\n- Renamed the Register dialog to the Licensing dialog.\n- Now access the Licensing dialog using Tools > Licensing.\n- In the Licensing dialog renamed 'Password' to 'License'.\n- In the Licensing dialog renamed 'Check License' to 'Activate License'.\n- General\n- Added Support Forum link to the Help menu.\n- The default color for highlighting is now set to light-blue text when using View > Highlighting.\n- Tweaked a number of colors for syntax highlighting, the text editor and the hex editor.\n- Tutorials have better support for dark themes.\n- Drag and drop works better from some other applications (e.g. WinRar).\n- On the View > Line Numbers menu, moved format options to a separate Display Format menu.\n- On the View > Ruler menu, moved format options to a separate Display Format menu.\n- On the View > Status Bar menu, renamed Units to Format.\n- The Bookmarks tab now shows \"(bookmark)\" in the Name column when the bookmark does not have a name.\n- Options Dialog\n- New style for the Options dialog.\n- On the General page added Application Scale Factor.\n- On the Editor page added Caret options.\n- Moved Highlight Current Line option to both the Text Editor and Hex Editor pages.\n- On the Text Editor page can set the whitespace symbol for the word wrap indicator.\n- On the Hex Editor page added option for lowercase hex.\n- On the Hex Editor page added option for Overlay Highlight Line.\n- On the Hex Editor page added some options for Addresses.\n- On the Fonts page can set the default line spacing.\n- On the Theme/Colors pages added Template Styles, Highlight Struct, Highlight Variable, Word Wrap Indicator, Node Open Text.\n- Bugs\n- Fixed crash with the Startup page when using Move to New Vertical Tab Group.\n- Fixed the MakeDir function was not using UTF-8 encoding properly.\n- Fixed changing Show Local Variables in one Template Results did not always propagate to all other editors.\n- Fixed rare bug with scrolling in the hex editor where the view was not updating properly.\n- Fixed was missing the --noexecstack flag on Linux.\n- Fixed hidden variables are now ignored when calculating variable highlights or hints in the hex editor.\n- Fixed the install program should not display any message boxes when run in silent mode.\n- Fixed the uninstall program should not display any message boxes when run in silent mode."
    }
  ],
  "Version": "14.0",
  "ReleaseTime": "2023-07-31"
}
