{
  "Version": "10.0.6",
  "Installer": [
    null,
    {
      "Architecture": "x86",
      "InstallerUrl": "https://download.wondershare.com/cbs_down/pdfelement-pro_10.0.6_full5239.exe"
    },
    {
      "Architecture": "x64",
      "InstallerUrl": "https://download.wondershare.com/cbs_down/pdfelement-pro_64bit_10.0.6_full5239.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Fully Empowered by AI!\nExperience the Power of AI: Chat with AI for personalized assistance with customized persona and prompts.\nAI-Powered Document Support: Get all the answers about your PDF with AI's comprehensive knowledge.\nEnhanced Session Management: Enjoy support for new sessions and access your session history easily.\nAI Touch-Up for Flawless PDFs: With just one click, proofread and get suggestions for document improvements.\nSeamless Translation: Effortlessly translate your documents for better readability.\nAI Summarization to Markdown: Summarize PDFs and convert them into Markdown format for streamlined note-taking.\nImmersive AI Read Mode: Immerse yourself in AI-enabled reading experiences.\nIntelligent Scanned Document Correction: Instantly deskew scanned documents with a single click.\nOptimized AI Summarization: Experience a simpler and more efficient operation.\nUnleash Comprehensive PDF Features!\nAdvanced Electronic Signatures: Request, track, and sign electronic signatures across cloud, mobile, and desktop.\nEnhanced PDF Management: Quickly access all your PDFs in the recent folder for seamless PDFs organization.\nSuperior Compression Efficiency: Optimize compression capabilities for a 20% improvement in document compression.\nSmooth Document Rendering: Enjoy improved document rendering capabilities and smooth scrolling.\nRevamped UI:\nCutting-Edge Visuals: Immerse yourself in a technologically advanced UI design with a complete visual overhaul.\nCustomizable Navigation Bar: Collapse the top, bottom, left, and right navigation bars and tailor them to your preference for an enhanced reading area.\nUpgrade to PDFelement V10 now and embrace a whole new level of AI-driven efficiency and productivity!"
    }
  ]
}
