{
  "Installer": [
    {
      "InstallerUrl": "https://download.bitcomet.com/achive/BitComet_2.05_setup.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "- GUI Improve: The traffic graph displays the disk read and write speed\n- GUI Improve: Added advanced options related to disk write cache too large prompts：ui.disk_writing_buffer_warning 以及 ui.disk_writing_buffer_warning_size_mb\n- GUI Improve: Each task can be individually set in the properties dialog box to enable proxies\n- GUI Improve: After selecting multiple tasks, the right-click menu allows you to batch set whether to enable proxies\n- GUI Improve: New proxy server option: Use proxy to connect to CometID\n- GUI Improve: Handle the situation of cloud service not started in the AppBind Dialog\n- GUI Bugfix: Batch download dialog sorting fails\n- GUI Bugfix: Install package of v2.04 didn't copy app icon file for toast notification of Win 10/11 action center\n- GUI Bugfix: When sorting the task list by the number of BT task seeds, the program crashes in some cases\n- GUI Bugfix: After deleting the RSS feed, the corresponding download filter should also be deleted\n- Core Improve: Torrent History, Share，Collection list and RSS Torrents list support torrent files in v2 and hybrid format. DHT Torrents and Tracker Torrents list cannot support it due to protocol limit.\n- Core Improve: Change the HTTP task stop operation to asynchronous mode and add a new task status of 'Stopping' to avoid interface lag caused by saving cached data\n- Core Improve: You can use the right-click menu to move downloaded files while the task is running, which will automatically pause the task and resume the task after the move is completed\n- Core Bugfix: When importing and exporting tasks across platforms, the file path separator is not automatically converted\n- Core Bugfix: Cannot save items acquired from BitComet task list RSS Feed."
    }
  ],
  "Version": "2.05",
  "ReleaseTime": "2023-11-28"
}
