{
  "Version": "12.5.0",
  "Installer": [
    {
      "InstallerUrl": "https://download.edrawsoft.com/cbs_down/edraw-max_12.5.0_full5371.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "1. Edraw AI 2.0: Access the AI feature through Edraw AI in the Top Menu, Quickly Tap the Space Bar Twice, and Edraw AI Floating Ball in the Lower Right Corner of the Canvas.\n\nAI Q&A: Generate answers and explanations in response to questions;\n\nAI Drawing: Generate flowcharts, mind maps, lists, and tables with simple commands;\n\nAI Writing: Assist with expanding and shortening paragraphs, polishing and breaking text, changing tones, and translation.\n\n2. [New Feature] One-Click Edit\n\nOne-Click Unified Settings: Unify settings for style, fonts, colors, and paragraphs in diagrams with one click;\n\nSmart Analysis: Detect possible design problems and provide automatic optimization for font, alignment, color, image size, and other issues in drawings with one click.\n\n3. [New Feature] Apache ECharts Visualization Charting Library\n\nExplore a variety of charts by clicking on Insert > Plug-in > Apache Echart or Insert > Chart > Apache Echarts.\n\n4. [Optimized] Formula Editor\n\n• Enhance the Formula Editor UI for improved user experience;\n\n• Support LaTeX formula input and conversion to MathML;\n\n• Support OCR recognition for extracting text from image formulas.\n\n5. [New Feature] OLE Embedded Object\n\n• Use the Insert > Object > Edraw.Document option in Office software to open the Edraw Diagram software for editing.\n\n• The edited file can be directly embedded into the third-party software's editing page.\n\n• Double click the graphic to open the EdrawMax software, eliminating the need to switch between software and saving time on multiple modifications.\n\n6. [New Feature] New diagram types, symbols, templates\n\n• Crime Scene Images: Investigators can use the provided templates and symbols to create a visual representation of the crime scene. Access this feature by clicking on New > Floor Plan > Crime Scene Images.\n\n• ArchiMate: Use this diagram for description, analysis, and visualization of architecture within and across business domains. Access it by clicking on New > Software & Database > Software Development > ArchiMate.\n\n7. [New] Plug-ins\n\n• iconfont: Alibaba Massive Icon Library\n\n• Pixabay: High-quality Picture Material Library\n\n8. [New Feature] Import of CAD files\n\n• Reconstruct the CAD underlying structure for a better experience;\n\n• Support batch import of CAD files, allowing users to select multiple files and import them in batches.\n\n9. [New] Add frames to pictures\n\n10. [New] PID Ductwork Symbols\n\nAdjustable multi-node PID Ductwork symbols with flexible stretching and splicing capabilities.\n\n11. [Others] Optimize Gantt, symbol search, shape alignment assistance, image export features, and etc. New resources of Floor Plan symbols, Arrow Shapes, Maps, and other symbols have been added."
    }
  ],
  "RealVersion": "12.5.0.997"
}
