{
  "Installer": [
    {
      "InstallerUrl": "https://engdownload.eassos.cn/DGEngSetup5501488.exe"
    },
    {
      "InstallerLocale": "zh-CN",
      "InstallerUrl": "https://download.eassos.cn/DGSetup5501488.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "1. Add support for reading ISO disc file system. The Sector Editor feature can jump to file system related structures and supports data template.\n2. Add support for reading ReFS file system, and the Sector Editor feature supports to jump to file system related structures.\n3. The feature of searching for lost partitions supports ReFS partitions.\n4. The Quick Partition feature adds EXT4 partition format.\n5. Optimize the file copy speed after recovering files and intelligently loading partitions.\n6. Optimize the recovery effect of recovering files from NTFS partitions.\n7. Optimize the recovery effect of recovering files from exFAT partitions.\n8. Improve the accuracy of recovering MXF files by type.\n9. The System Migration feature temporarily stops supporting MBR disks booted in EFI mode.\n10. Fixed an issue that long volume label couldn't be entered during using Quick Partition feature.\n11. Fixed an issue that exception occurred when resizing partition of a large-capacity hard drive.\n12. Fixed an issue that the folder permission got changed after cloning the EXT4 partition.\n13. Fixed an issue that the block bitmap might have errors after cloning the EXT3 partition.\n14. Fixed an issue of parsing the file directory of exFAT partition used by some systems.\n15. Fixed an issue that the 64-bit version couldn't run due to the lack of Winhttp.dll under WinPE.\n16. Fixed an issue that the backup of BitLocker drive which was unlocked by system failed.\n17. Fixed an issue that the capacity of lost BitLocker partition was not displayed correctly when the partition was found but not unlocked.\n18. Fixed an issue for the Backup Disk To Image File feature that logical partitions were displayed incorrectly.\n19. Fixed an issue that sometimes partitions couldn't be switched by clicking the partition map area after restoring partition from image file.\n20. Fixed an issue that the 'Go to sector offset' feature in Sector Editor did not jump according to the current position.\n21. Fixed an issue that errors occurred in reading Storage Space whose provisioning type is FIXED.\n22. Add Turkish language pack."
    },
    {
      "Locale": "zh-CN",
      "Key": "ReleaseNotes",
      "Value": "1. 增加对 ISO 光盘文件系统的读取支持、扇区编辑功能中文件系统有关结构的扇区跳转、数据模板支持。\n2. 增加对 ReFS 文件系统的读取支持、扇区编辑功能中文件系统有关结构的扇区跳转支持。\n3. 搜索丢失分区功能，支持 ReFS 分区。\n4. 快速分区功能，添加 EXT4 分区格式。\n5. 优化恢复文件以及智能加载分区后的文件复制速度。\n6. 优化 NTFS 分区文件恢复效果。\n7. 优化 exFAT 分区文件恢复效果。\n8. 提高按类型恢复 MXF 文件的准确度。\n9. 系统迁移功能，暂时停止对 EFI 方式启动的 MBR 磁盘的支持。\n10. 纠正快速分区时无法输入长卷标的问题。\n11. 纠正调整大容量硬盘的分区大小时出现异常的问题。\n12. 纠正克隆 EXT4 分区后，文件夹权限发生变化的问题。\n13. 纠正克隆 EXT3 分区后，块位图可能出现错误的问题。\n14. 纠正对某些系统使用的 exFAT 分区文件目录解析的问题。\n15. 纠正 64 位版本在 WinPE 下因缺少 Winhttp.dll 导致软件无法运行的问题。\n16. 纠正系统解锁的加密分区备份失败的问题。\n17. 纠正搜索到丢失的 BitLocker 分区但不解锁时，分区容量显示不正确的问题。\n18. 纠正备份整个磁盘到镜像文件功能，逻辑分区显示错误的问题。\n19. 纠正从镜像文件还原分区后，点击分区图有时无法切换分区的问题。\n20. 纠正扇区编辑中的“跳转扇区偏移”功能没有根据当前位置跳转的问题。\n21. 纠正 FIXED 形式的存储空间读取异常的问题。"
    }
  ],
  "Version": "5.5.0.1488",
  "ReleaseTime": "2023-03-14"
}
