{
  "Installer": [
    {
      "Architecture": "arm64",
      "InstallerUrl": "https://download.typora.io/windows/typora-setup-arm64-1.4.3.exe"
    },
    {
      "InstallerLocale": "zh-CN",
      "Architecture": "arm64",
      "InstallerUrl": "https://download2.typoraio.cn/windows/typora-setup-arm64-1.4.3.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Note: This version does not support Windows 7 yet.\nNew\n- Upgrade mermaid version. Support inline mermaid configs.\n- Upgrade mathjax version.\n- Add copy as image option for math and diagrams.\n- Add option to mix files and folders when sorting in file tree.\n- Add sort by creation time option for file tree / file list.\n- File tree view and file list view now is configured separately.\n- Increase max line count for global search results.\n- Fuzzy search in Open Quickly will now also match folder path.\n- Add new math auto numbering rule — AMS Numbering Rules (where only certain environments produce numbered equations, as they would be in LaTeX).\n- Add option to always add “./” when generating relative path for images.\n- Add rename image in context menu. (Which is the same menu item with move images).\n- Improve Pascal lang support, add more keyword highlight for Pascal.\n- Add syntax support for Smarty.\n- Improve performance when using find function and prevent hangs.\n- Make search result more readable compared to ==highlight== texts.\n- Increase max col count in table edit UI.\n- Recognize .qmd as markdown file.\n- Now user can select multiple cols and apply text align from table tool tip all at once.\nFix\n- Fix bugs about switching files.\n- Fix triple click on code block.\n- Fix code block height not auto changed when enter or exit fullscreen mode on macOS.\n- Make font color of completed task more readable in dark themes\n- Fix some rendering issue for mermaidjs.\n- Remove unnecessary horizontal scroll bar on side bar.\n- Fix undo deleted file not displayed in file tree view.\n- Fix error when switch files.\n- Fix hint behavior when hover on folders of sidebar menu.\n- Use smaller margin between math block and normal paragraphs.\n- Fix compatibility issues when search with Tai.\n- PDF export now supports headers or footers contains non-ASSIC code when export.\n- Improve image export quantity.\n- Fix PDF export not working on Windows when user account contains special characters.\n- Fix epub export show warnings in epub reader when contains video tag\n- Fix page size setting of PDF not working on macOS when export.\n- Fix the setting of margin right and margin left of PDF not correctly applied when export.\n- Fix last export path not saved on macOS.\n- Fix docx import fail on newer pandoc versions.\n- Fix replace may ignore search results matches with regular expressions contains non-capture groups.\n- Fix move images not working for windows.\n- Improve performance when md file contains video tag.\n- Fix a caret jump issue when typing after inline math.\n- Fix minor issues with spellcheck.\n- Fix load image with src contains escaped @ mark.\n- Fix save-as sometimes not popped up on diagrams.\n- Update language translations."
    },
    {
      "Key": "ReleaseNotesUrl",
      "Value": "https://support.typora.io/What's-New-1.4/"
    }
  ],
  "Version": "1.4.3"
}
