{
  "Version": "13.0.25",
  "Installer": [
    {
      "InstallerUrl": "https://download.wondershare.com/cbs_down/filmora_64bit_13.0.25_full846.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "<p><span><span class=\"ui-provider ee chi bue chj chk chl chm chn cho chp chq chr chs cht chu chv chw chx chy chz cia cib cic cid cie cif cig cih cii cij cik cil cim cin cio\" dir=\"ltr\">Please note that Filmora V13 is a free major upgrade for subscription users, and an upgrade fee may apply for perpetual users. New features include: <br /> <br />1. AI Copilot Editing <br />An interactive AI editor to assist you in completing video editing tasks more efficiently with just a conversation. <br /> <br />2. AI Text-to-Video <br />Transform your text into videos: Our advanced AI-powered algorithms allow you to convert articles or text files into engaging, customizable videos quickly and easily.  <br /> <br />3. AI Text-Based Editing  <br />Automatically transcribe the audio in your videos into text, enabling you to edit your videos just like a document. <br /> <br />4. AI Music Generator  <br />Leverage AI to generate royalty-free music for your videos, pick from specific themes and customize the duration based on your needs. <br /> <br />5. AI Thumbnail Creator <br />Apply pre-designed templates to create your video thumbnails by editing text, cropping portraits, and more. <br /> <br />6. Compound Clip (Nesting)  <br />Group multiple video clips, audio tracks, and effects into a single group, streamlining complex editing tasks while maintaining precision. <br /> <br />7. AI Vocal Remover  <br />Instantly extract, separate, or remove vocals from any music without compromising the audio quality. <br /> <br />8. Keyframe Graph Editor  <br />Use the Velocity Graph to fine-tune motion or value changes before and after keyframe points to achieve fluid animation sequences and simulate realistic motions. <br /> <br />9. Playback Speed Shortcuts (JKL)  <br />Use Playback Speed Shortcuts to review footage or swiftly skim through your project files to identify key segments. <br /> <br />10. AI Smart Masking  <br />Intelligently recognize your footage’s subject and automatically generate masks around them, enabling various creative possibilities. <br /> <br />11. Multi-Clip Editing  <br />Multi-Clip Editing allows users to edit and add effects to multiple selected clips simultaneously. <br /> <br />12. Optimized Video Templates  <br />Choose from our wide range of pre-designed templates, perfect for daily creation needs. Just drop in your media, and you’re ready to publish. <br /> <br />13. Slow Motion with Optical Flow  <br />Utilize Optical Flow technology to create ultra-smooth, high-quality slow-motion effects. <br /> <br />14. Pro Video Scopes  <br />The new Pro Video Scopes in Filmora provide RGB waveform monitors and vectorscopes, ensuring the best possible color accuracy and video consistency. <br /> <br />15. Customizable Backgrounds <br />Eliminate unwanted black bars with easy aspect ratio adjustments or apply your own image to finish with a stylish blur. <br /> <br />16. Effect Collections <br />Curated collections of the best music, titles, and other effects in the Filmora Effect Library. <br /> <br />17. Optimized Screen Recording  <br />Record your screen and webcam in separate clips. <br /> <br />18. AI Skin Tone Protection  <br />Fine-tune your clips to preserve skin tone integrity regardless of your LUTS or grading. Isolate and enhance human skin to emphasize its true hue.</span></span></p>"
    }
  ],
  "RealVersion": "13.0.25.4414"
}
