{
  "Version": "12.0.9",
  "Installer": [
    {
      "InstallerUrl": "https://download.wondershare.com/cbs_down/filmora_64bit_12.0.9_full846.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Note：For users whoare currently on one-time purchase plan of Filmora,you may be charged for extra fee for upgrading to Filmora 12.\n\nWhat's new in Filmora V12:\n\nSwitchable Workspace Layouts.Choose from 5 predefined workspace layouts that best fits your workflow and monitor size. You can also view media playback on an external monitor by selecting the \"Dual Monitor\" workspace.\n\nEnhanced Keyframe, Keyframe has been expanded to all parameters in Filmora V12, including filters and color correction in addition to position, rotation, scale.\n\nAdjustment Layer.Create adjustment layers and use them to apply the same effect to multiple clips on the timeline. The effects applied to an adjustment layer affect all layers below it in the layer stacking order.\n\nDraw Mask.Create free-form shapes using the pen tool. It lets you freely draw complex mask shapes around objects, which can be either straight lines or curve segments with Bezier path.\n\nAI Audio Stretch.With the AI-powered audio stretch tool, you can intelligently retime audio to match the duration of your video. No need to cut straight across or repeat the music again.\n\nAI Smart Cutout.The Smart Cutout tool allows quick AI-powered selections of both people and objects.\n\nAI Audio Denoise.The AI-powered audio denoise tool helps you reduce background noises better.\n\nAssets Backup & Sync.Use your Wondershare ID to backup your imported media, project files, favorite effects, customized titles, etc. Never lose these valuable assets again.\n\nVideo Review and Collaboration.Seamlessly share your video securely and invite your team to add time-coded notes and respond to comments via Filmora Workspace cloud service.\n\nMore Keyboard Shortcut Presets.You can now select a shortcut preset from Premiere Pro or Final Cut Pro and use it along with your usual keyboard shortcuts in Filmora.\n\nMultiple Platform Support.Edit your videos anywhere with Filmora, whether on desktop or on the go. Using the Filmora Workspace cloud service, video clips can also be transferred from the Filmora mobile application to desktop for further editing.\n\nRevamped Effects Library.Faster navigation experience when browsing Filmora effects.\n\n3D Titles.Create 3D titles easily from preset 3D templates."
    }
  ],
  "RealVersion": "12.0.9.1382"
}
