{
  "Version": "12.1.6",
  "Installer": [
    {
      "InstallerUrl": "https://download.wondershare.com/cbs_down/filmora_64bit_12.1.6_full846.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "<p><b>Timeline</b></p>\n<ol>\n<li><span>You can use Alt+ Click, Shift + Click and Ctrl+Click keyboard combinations to perform copy, align and insert clips on the timeline more convenient.</span></li>\n<li><span>You can copy and paste transitions directly on the timeline now.</span></li>\n<li><span>The scrolling direction of the timeline are now switchable in keyboard shortcuts setting window. </span></li>\n<li><span>Select, Audio Stretch and Quick Split tools are put together on the timeline toolbar.</span></li>\n</ol>\n<p><b>Titles</b></p>\n<ol>\n<li><span>The texts you input after editing the titles are now shown directly on the title clip in timeline directly.</span></li>\n<li><span>Optimized the default border and shadow preset for creating SRT subtitles.</span></li>\n</ol>\n<p><b>Property Panel</b></p>\n<ol start=\"5\">\n<li><span>More accurate controls for popup buttons and input fields.</span></li>\n<li><span>Added keyframe shortcuts support adding transparency keyframes</span></li>\n<li><span>You can use the Ctrl+ Mouse wheel combination to zoom in and out in the preview player directly.</span></li>\n</ol>\n<p><b>Miscellaneous</b></p>\n<ol>\n<li><span>Added a checkbox in export setting window to remember the export profile you used last time.</span></li>\n<li><span>Able to set default project settings for starting projects quicker next time.</span></li>\n<li><span>The quick through guide is updated to fit Filmora V12 layout better.</span></li>\n<li><span>The recommendations in “Audio” library can be filtered as Music and Sound Effect. </span></li>\n<li><span>Optimized the workflow for sharing files to Filmora Workspace collaboration platform.</span><span></span></li>\n<li><span>And fixed some bugs.</span><span></span></li>\n</ol>"
    }
  ],
  "RealVersion": "12.1.6.1941"
}
