{
  "Installer": [
    {
      "Architecture": "x86",
      "InstallerUrl": "http://116.198.40.241/everedit_win32_4500_setup.exe"
    },
    {
      "Architecture": "x64",
      "InstallerUrl": "http://116.198.40.241/everedit_win64_4500_setup.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "- Improved performance of rendering long lines\n- Fixed a bug of JS template string highlight\n- Fixed a bug of user tool on capturing output\n- Fixed a bug of PersistentStringTable (not implemented RemoveAt)\n- Use first selection to quick match after pressing Ctrl+D\n- Fixed a bug of find/replace dialog with multiple monitors\n- Blink at statusbar if main window is not visible after opening files\n- Added Select All Matches in find dialog\n- Force to sort by alphabet after opening quick directory\n- Fixed a bug about restoring full width brackets.\n- Added a new option to control whether output line number for output windows (Right click output window to enable this option)\n- Markdown mode now supports relative image path\n- Added new function and props: App.DeleteTemplate/App.SCRIPT_FULLNAME/App.SCRIPT_NAMEONLY\n- Improved name rule on creating files, the minimum unused number will be selected.\n- Improved accuracy of file encoding detection.\n- Improved some dialogs display on high DPI\n- Fixed a regular expression bug on using \\b to match CJK characters.\n- Fixed a bug on making selection by clicking line number"
    },
    {
      "Locale": "zh-CN",
      "Key": "ReleaseNotes",
      "Value": "- 优化打开含有特别长的行时的性能和渲染问题\n- js 语法着色模板字符串的问题\n- 自定义工具捕获输出时，因缓存过小导致的乱码问题\n- PersistentStringTable 的 RemoveAt 未实现的 bug\n- Ctrl+D 向下快速选择时，使用第一个选区的文本作为样本进行匹配\n- 在多个显示器间打开搜索替换对话框时，定位不准确的问题\n- 在主窗体不可见时打开不存在的文件时，不会弹出对话框，而是在变为可见时，在状态栏闪烁提示\n- 查找对话框增加选择全部匹配的命令(查找->高级->选择所有匹配)\n- 快捷目录展开目录时，强制进行一次字母排序\n- 全角括号的配置被自动恢复的问题\n- 输出窗口增加控制选项，可以控制是否显示匹配的位置（右键点击输出窗口可以勾选设置）\n- Markdown 模式支持图片相对路径\n- 脚本增加 App.DeleteTemplate/App.SCRIPT_FULLNAME/App.SCRIPT_NAMEONLY\n- 优化创建文件时自动命名规则，优先未使用的最小标号\n- 优化编码探测的准确性\n- 优化部分界面在高 DPI 时的显示\n- 修正正则对于汉字字符界定不正确的问题\n- 修正点击行号进行行选择时对于最后一行处理不当的问题"
    }
  ],
  "Version": "4.5.0.4500",
  "ReleaseTime": "2023-04-02T11:34:47Z"
}
