{
  "Version": "10.5.3",
  "Installer": [
    {
      "InstallerUrl": "https://download.edrawsoft.com/cbs_down/edrawmind_10.5.3_full5370.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "1. The new function of OCR Image Recognition only takes one click to extract the text in the image into text content, click [Advanced]-[OCR] to get started!\n2. The new Outline Mode is launched, greatly improving editing performance. At the same time, the newly launched paper mode and custom background function support setting paper transparency and Gaussian blur. Come and create your exclusive outline mode workspace!\n3. Same-level Theme Alignment and Theme Overlay functions allow you to easily handle all vertical mind map styles.\n4. The new function of Personal Template allows you to create a template and reuse it with one click. Find it in [File] - [Save As] - [Personal Template] to make drawing more efficient! Create your personalized template now!\n5. The Third-Party Resource Library function Pexels, Emoji, allows you to use millions of resource materials for free, so as to enrich your mind map. This function can be find on ‘More’ - [Third-Party Material Library].\n6. The Tag Function has been upgraded to make inserting labels more convenient. At the same time, the Tag color is more customizable, the Tag style is more beautiful, and the theme management and filtering are more efficient.\n7. Added Style Following and Style Reset functions. After enabling this function, the styles of newly added themes and sub-themes will follow the last setting by default.\n8. Optimize the mind map background function. When adding a local picture as the background of the mind map, it will be tiled to the entire canvas by default to make the effect more beautiful.\n9. Upgrade the Shortcut Setting Bar function, the shortcut bar supports temporary hiding and fixing, and the shortcut bar will no longer block your sight and will be a good helper for your style settings.\n10. Added View Navigation function. Click the ‘View Navigation’ function in the lower right corner of the editing area, you can have a panoramic view of the map context, try it out!"
    }
  ],
  "RealVersion": "10.5.3.202"
}
