{
  "Installer": [
    {
      "InstallerUrl": "https://gms.yoyogames.com/GameMaker-Installer-2023.6.0.92.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "June’s 2023.6 release brings to the IDE: important SSO login fixes; a new project loading/conversion tool which GameMaker will use to convert older/newer projects into a format suitable for opening in this IDE version; a new Sprite Editor option for Spine collisions; Font Editor and Inspector options for controlling SDF font support in your games; a fix for copy/pasting in images from other art packages and also for pasting large amounts of clipboard text into Code Editors; a number of other stability fixes for various bits of functionality throughout GameMaker; and it also makes Feather default to being enabled for new users and users who have never tried enabling Feather in the past (if you have enabled it and then disabled it again, this setting will not be overwritten).\nOn the runtimes side there are: new debug overlays which use a new GUI system; 3 new audio effects; support for the new NPLN multiplayer system on Switch; changes to Xbox GDK to make video rendering require the same setup as the other platforms and being able to read old UWP saves in your GDK games; changes to Cocoapods to make them easier to setup and more reliably handle existing setup issues on the Mac; a new “game launcher” system; support for a struct “shorthand” style in the Code Editor and for the new Spine collisions and SDF font controls already mentioned above; lots of other new functions and a number of important bug fixes.\nThere are updates to our recently-introduced Live Wallpapers template included in this release, so if you have been developing your own wallpapers already, please do review the new template project and port any changes to your own projects.\nFinally, you will also find that in the Help menu inside GameMaker there is a new \"Create Your Bug Report Package\" option - this new tool will collect and zip up all the various files we usually ask for when answering any tickets you have submitted, making it much easier for you to send us all the information we require if you do have an issue using GameMaker. You can find more info on this tool lower down in the IDE notes.\nPlease do check your SDKs and other external tools are the correct versions before doing any builds - you can see our Required SDKs FAQ and the various platform setup guides that page links to in order to get all of this information at any time.\nSee below for all IDE changes/fixes since 2023.4.0 and then check the Runtime Release Notes for all the in-game ones."
    }
  ],
  "Version": "2023.6.0.92",
  "ReleaseTime": "2023-07-19T11:10:11Z"
}
