{
  "Version": "9.2.1",
  "Installer": [
    {
      "InstallerUrl": "https://download.wondershare.com/cbs_down/pdfelement6_full2989.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "PDFelement has ended support for the current version, please update to the latest major version 9 to enjoy more advanced features with a better user experience!\nNot only will you enjoy a faster start-up speed, but you will also be able to convert to MS Office more accurately.\nNew Features and Improvements in PDFelement V9!\nVisual Upgrade:\n1. A new user interface helps you to enjoy a larger reading space, a more immersive reading experience, and more convenient viewing settings.\n2. Update user interface to improve usability and product experience;\n3. Optimize the navigation bar to be more user-friendly.\nPerformance enhancement:\n1. A 30%+ faster-rendering speed while opening PDF compared to the old version;\nMore advanced features:\n1) The New Start Page:\n- Organize, manage and search your PDFs;\n- Custom quick tools to your needs.\n2) Better Edit Experience:\n- You can have a smoother editing experience;\n- Support for editing specific objects, including text, images, and links;\n- Optimize the editing experience for watermark, background, header & footer, and bates number;\n- Optimize the editing experience for images and links.\n3) Document Cloud:\n- Support for editing and reviewing PDFs in real-time across web, mobile, and Desktop through Document Cloud:\n- Support for sharing PDFs with others by creating a sharable link through Cloud.\n4) More PDF Tools:\n- Support for translating the selected text into a target language;\n- Support for recognizing tables in the PDF, and then copying and pasting them into Word or Excel;\n- Support for customizing shortcut keys;\n- Support for taking a scrolling screenshot of the current window.\n5) Better Comment Experience:\n- Support for extracting pages with comments into a new PDF;\n- Optimize comment-adding experience, including color setting and properties.\n6) More View Setting:\n- Support for showing cover page in two-page view;\n- Support for rotating view with the way you want;\n- Support for adding comments in full-screen mode to enhance your reading experience;\n- Optimize the page background color and settings.\n7) Better Prepare Form Experience:\n- Support for editing and adding text in form mode;\n- Optimize the form styles and settings."
    }
  ],
  "RealVersion": "6.8.9.4193"
}
