{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.71.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Prolog adapter and integration files\n- REMOVED: Scryer Prolog is no longer supported due to the system refusal to implement (or accept contributions implementing) the required de facto standard version_data flag.\n- FIXED: The GNU Prolog adapter file for compatibility with versions older than 1.6.0.\nDocumentation\n- IMPROVED: Simplified finding the goal to use to load an entity when browsing the APIs documentation.\n- IMPROVED: Documentation of the embedding scripts on how to handle an application using a mix of Logtalk and Prolog source files.\n- FIXED: Texinfo navigation between Handbook and APIs documentation.\nLibrary\n- UPDATED: The tester_versions.lgt library file to use the de facto Prolog standard version_data flag to print any additional backend Prolog version data (e.g. a git commit hash).\nTools\n- CHANGED: The debugger tool to print a procedure box port for spy points when the port is unleashed.\n- IMPROVED: The packs tool linting of pack specifications to also check that pack versions are listed from newest to oldest.\n- UPDATED: Entity documentation generated by the lgtdoc tool now includes the goal required for loading each entity.\n- UPDATED: The tutor tool for the new linter warning on missing arithmetic functions.\n- FIXED: The packs tool linting of pack specifications would wrongly report pack dependency versions using only Major:Minor or Major.\nExamples\n- CHANGED: The document_converter example to ensure UTF-8 encoding of the text files resulting from PDF files conversion.\n- UPDATED: The errors example to illustrate linter arithmetic function warnings."
    },
    {
      "Key": "ReleaseNotesUrl",
      "Value": "https://github.com/LogtalkDotOrg/logtalk3/blob/master/RELEASE_NOTES.md#3710---october-12-2023"
    }
  ],
  "Version": "3.71.0",
  "ReleaseTime": "2023-10-12"
}
