{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.60.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- ADDED: Linter check for the availability of predicates (and non-terminals)\nlisted inuses/2anduse_module/2directives. Controlled by the flagunknown_predicates.\n- IMPROVED: Readability of default flag values printed at startup.\n- FIXED: When reporting calls to non-standard arithmetic functions don't\ndescribe them as built-in functions as most Prolog systems fail to provide\nreflection support to check or enumerate built-in functions.\nProlog adapter and integration files\n- UPDATED: All backend adapter files to recognize.proas a valid Prolog\nfile name extension.\n- UPDATED: The Scryer Prolog adapter file to require version 0.9.1 or later.\nDocumentation\n- ADDED: Newlgtunittool documentation section on working with test data\nfiles.\n- IMPROVED: The Handbook inheritance section on the predicate lookups order.\n- IMPROVED: The Handbook pages on some predicate directives by linking to the\ncorresponding glossary definitions.\n- UPDATED: The manual installation instructions in theINSTALL.mdfile forzshusers.\nLibrary\n- ADDED: Newjsonlibrary parsing sourceline(Stream)to parse a single\nline from the given stream into a JSON term.\n- ADDED: Support for alternative term representations of JSON objects and JSON\npairs to thejsonlibrary.\n- FIXED: Bug in thejsonlibrary handling of JSON escape sequences.\n- ADDED: Libraryreader::line_to_chars/2-3predicates.\n- FIXED: Mode directives for thereader::line_to_codes/2-3predicates.\n- FIXED: Also declare as synchronized theterm_iopredicatesread_term_from_chars/4andread_term_from_codes/4.\nTools\n- CHANGED: Renamed thelgtdoctoollgtdoc_missing_periodslinter flag tolgtdoc_missing_punctuationand accept also exclamation and question marks.\n- ADDED: New linter warning to thelgtdoctool for invalid dates ininfo/1directives.\n- ADDED: Newlgtunittoolfile_path/2protected predicate for computing\nabsolute paths for file paths relative to test object paths.\n- IMPROVED: Thelgtdoctool linter warnings to include the file line number.\n- IMPROVED: More portable checking of thepackstool required command-line\nexecutables in POSIX systems.\n- FIXED: Thelogtalk_doclet.shscript when using a backend Prolog system\nthat requires command-line passed queries to end with a period.\n- FIXED: Thelogtalk_tester.shscript to ensure that the searching for\natester.shfile to be sourced is restricted to the test set directory.\n- FIXED: Thelogtalk_tester.ps1script sourcing oftester.ps1files found\nin the test set directory.\n- FIXED: List of dependencies for the developer tools for Ubuntu.\nExamples\n- IMPROVED: Documentation of thepeopleexample.\n- FIXED: Test for thejplexample to correctly compare floats.\nTests\n- ADDED: Additional tests for the Prolog standardatom_chars/2,atom_codes/2,number_chars/2, andnumber_codes/2predicates.\n- UPDATED: Several Prolog compliance tests to use the newlgtunittoolfile_path/2predicate.\nInstallers and installation scripts\n- IMPROVED: Thelogtalk_user_setup.shandlogtalk_user_setup.ps1scripts\nto detect when theLOGTALKHOMEandLOGTALKUSERenvironment variables point\nto the same directory and refuse to run.\nIDEs, text editors, and syntax highlighters support\n- ADDED: Support for escape sequences inside double-quoted terms to most text\neditors and syntax highlighters.\n- UPDATED: Syntax highlighting test files to test escape sequences inside\ndouble-quoted terms.\n- FIXED: Deleted accidentally committed temporary files in thecoding/testsdirectory."
    }
  ],
  "Version": "3.60.0",
  "ReleaseTime": "2022-11-15"
}
