{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.65.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- CHANGED: Calls to unknown dynamic predicates in this from a category to throw an existence error instead of failing.\n- ADDED: Support to the (@)/1 control construct for calling a predicate in this from any category and from objects.\n- ADDED: Support for mode/2 directive zero_or_more_or_error and one_or_more_or_error number of proofs.\n- ADDED: Support for a info/2 directive since key to document the version that added a predicate.\nProlog adapter and integration files\n- ADDED: LVM adapter file support for the new add_csv/3 built-in predicate introduced in version 6.0.0.\n- FIXED: The Scryer Prolog adapter file internal predicate for retrieving environment variable values. Thanks to Joe Taber for the bug report.\nDocumentation\n- ADDED: Documentation for the (@)/1 control construct, which allows calling predicates in this from within categories.\n- IMPROVED: Handbook documentation on documenting predicates using the mode/2 directive.\nLibrary\n- IMPROVED: Reduced the number of atoms created when calling the atom::replace_sub_atom/4 library predicate.\n- FIXED: The git library when working with paths containing spaces.\n- FIXED: The os::date_time/7 library predicate for Scryer Prolog when the double_quotes flag is set to atom.\nTools\n- CHANGED: The debugger tool notrace/0 predicate to only turn off tracing, thus allowing the debugger to continue to stop at defined spy points.\n- CHANGED: The lgtunit tool input/output testing predicates to always interpret relative paths as relative to the tests object path and to always open temporary files in the same directory as the tests object. This simplifies usage and improves reliability by not depending on the current working directory.\n- CHANGED: The lgtunit tool file_path/2 to also accept absolute file paths (further expanding them to resolve any remaining relative file path parts).\n- CHANGED: The lgtunit tool support for generating Allure reports now requires version 2.21.0 or later.\n- CHANGED: The lgtunit tool xunit_output and xunit_report formats to include as test case properties the test file, test lines, test URL, and test note (if any).\n- CHANGED: The lgtunit tool xunit_net_v2_output and xunit_net_v2_report formats now include the test note (if any) as a test trait for all outcomes.\n- CHANGED: The lgtunit tool run/1 predicate to also save and restore the current output stream and working directory when running tests. Moreover, the predicate now only fails when given a partial list of tests or when one of the test identifiers is not valid.\n- ADDED: New debugger tool port command N to turn off tracing.\n- ADDED: Support to the lgtdoc tool to output info/2 directive since keys.\n- ADDED: New lgtunit tool clean_directory/1 protected predicate to delete an empty directory if it exists.\n- IMPROVED: Reduced the number of atoms created when using the diagrams, lgtdoc, and lgtunit tools.\n- IMPROVED: The lgtunit tool now saves and restores the current working directory when running tests.\n- IMPROVED: The lgtunit tool file_path/2 and clean_file/1 utility predicates to expand the constructed absolute file path to resolve any remaining relative file path parts.\n- IMPROVED: The lgtunit tool documentation of the input/output testing predicates.\n- IMPROVED: The logtalk_allure_report scripts to check if Allure is installed and the required minimal version.\n- IMPROVED: The debugger tool debugging/0 predicate now also prints the maximum write depth for terms.\n- UPDATED: The logtalk_allure_report scripts to add a categories.json file to classify failed tests.\n- FIXED: The lgtunit tool xUnit format support to ensure that test URLs are correct when the suppressed path prefix ends with a slash.\n- FIXED: The logtalk_tester.ps1 script reporting of test sets with multiple or parametric test objects.\n- FIXED: The debugger tool to reset skipping and zapping state when tracing a new top-level query. Thanks to Lindsey Spratt for the bug report.\n- FIXED: The debugger tool notrace/0 and nodebug/0 predicates when the leap command as used before calling the predicates. Thanks to Lindsey Spratt for the bug report.\nExamples\n- FIXED: The tester.ps1 files for the clustering, document_converter, and neo4j Java examples to avoid PowerShell errors when running the logtalk_tester.ps1 automation script with options other than -p.\nTests\n- ADDED: Tests for the (@)/1 control construct.\n- ADDED: Tests for the ISO Prolog standard line and block comment syntax.\n- IMPROVED: Add note/1 option to tests that are skipped due to being STO.\n- IMPROVED: Add note/1 option to tests that are skipped due the lack of a Prolog portable solution to specify text encoding.\n- UPDATED: The tests for the uses/2 directive for Scryer Prolog.\n- FIXED: The tests for the diagrams tool to use the Logtalk default scratch directory as the temporary directory for generated diagram files.\nInstallers and installation scripts\n- ADDED: Preliminary support for Scryer Prolog to the Windows installer. Assumes a C:\\scryer-prolog\\scryer-prolog.exe executable.\n- ADDED: Preliminary support for Trealla Prolog to the Windows installer. Assumes a C:\\tpl-windows-x64\\tpl.exe executable."
    }
  ],
  "Version": "3.65.0",
  "ReleaseTime": "2023-04-27"
}
