{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.72.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- ADDED: Linter warnings for use of unsound calls in grammar rules (when the argument of a (\\+)/1 call or the condition in (->)/2 or (*->)/2 calls is not {}/1).\n- ADDED: Linter warning for calls to the deprecated predicates not/1 and fail_if/1.\n- IMPROVED: Simplified handling of plain Prolog terms when compiling source files.\n- IMPROVED: Avoid computing directory hash twice when compiling a source file.\n- IMPROVED: Performance when compiling object and category facts.\n- IMPROVED: Performance when compiling entity ground terms.\n- IMPROVED: Performance when compiling entity terms that are not expanded.\n- FIXED: Catch any errors during the compilation of the begin_of_file virtual term.\n- FIXED: Minor performance bug when compiling clauses for multifile predicates of parametric entities.\n- FIXED: Reporting of compiler instantiation errors in clause and grammar rule heads where a '$VAR'/1 or '$VAR'//1 term would be displayed.\nProlog adapter and integration files\n- UPDATED: Notes on the LVM adapter file for enabling coinduction support.\nDocumentation\n- ADDED: Documentation to the lgtunit tool on mocking solutions.\n- ADDED: Documentation to the lgtunit tool on test execution times and memory usage.\n- ADDED: Documentation to the lgtunit tool on testing or suppressing expected output written to user_error and other streams.\n- IMPROVED: Handbook section on performance.\n- IMPROVED: Handbook documentation of the (\\+)/1 and forall/2 built-in methods.\n- FIXED: Allow Handbook and APIs documentation search support to work offline.\nTools\n- ADDED: Predicate help::man/1 for inline browsing of man files.\n- UPDATED: The tutor tool for the new linter warnings on unsound calls in grammar rules.\n- FIXED: Typo in the packs tool error message when uncompressing a pack archive fails.\nExamples\n- UPDATED: The documentation of the metainterpreters example.\nInstallers and installation scripts\n- UPDATED: The macOS installer to also add the Logtalk default paths to the PATH, MANPATH, and INFOPATH environment variables.\n- UPDATED: The Windows installation script to also detect upcoming SICStus Prolog 4.9.x versions."
    },
    {
      "Key": "ReleaseNotesUrl",
      "Value": "https://github.com/LogtalkDotOrg/logtalk3/blob/master/RELEASE_NOTES.md#3720---november-9-2023"
    }
  ],
  "Version": "3.72.0",
  "ReleaseTime": "2023-11-09"
}
