{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.62.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- ADDED: Message token tab(Expression) to the logtalk built-in object.\nProlog adapter and integration files\n- UPDATED: Simplify integration script for Trealla Prolog.\nDocumentation\n- UPDATED: Man pages of integration scripts that accept a command-line option for silencing informative messages.\n- FIXED: Permanently redirected and broken hyperlinks in the Handbook and developer tools documentation.\nLibrary\n- ADDED: Preliminary version of sequence grammar rules to the grammars library.\n- IMPROVED: Documentation of the hook_objects library.\n- FIXED: Workaround issue with the SWI-Prolog implementation of the standard initialization/1 directive by skipping two tests of the timeout library.\nTools\n\n- ADDED: Option to the logtalk_tester.sh and logtalk_tester.ps1 scripts for excluding directories using a regular expression.\n- ADDED: New debugger tool port option to skip debugging for the current goal but displaying all intermediate ports unleashed.\n- ADDED: New debugger tool port option to read and throw and exception term (as in the SICStus Prolog debugger).\n- ADDED: Experimental lgtenv.sh and lgtenv.ps1 scripts for creating packs virtual environments.\n- ADDED: New packs tool available/2 and versions/3 predicates.\n- ADDED: New update/1 option to the packs tool registry adding and pack installation predicates.\n- IMPROVED: The diagrams tool lgt2svg.sh and lgt2svg.ps1 scripts to alert the user when one or more files could not be converted (usually due to Graphviz crashes).\n- UPDATED: The update_svg_diagrams.sh script to exit with the same code as the called lgt2svg.sh script.\n- UPDATED: The packs tool to also recognize as a valid registry and pack readme file name case variations of NOTES with or without a .md or .txt extension.\n- FIXED: Document packs tool predicates possible exceptions.\n- FIXED: Missing type-checking of some arguments of some of the packs tool predicates.\n- FIXED: The debugger tool to consume any new-line code after the user answers a question at a leashed port to avoid an automatic creep when returning to the port after calling the goal.\nExamples\n- FIXED: Portability issue in the bench example that prevented running the flatten benchmark with some backend Prolog systems.\n- FIXED: Avoid a linter warning when loading the assumptions example.\nTests\n- ADDED: Additional tests for the Prolog standard sub_atom/5 predicate. Contributed by Lindsey Spratt from the LVM development work.\n- ADDED: Additional test for the Prolog standard unify_with_occurs_check/2 predicate.\n- ADDED: Additional test for the de facto Prolog standard format/2-3 predicates for the ~0f format specifier. Test case contributed by Andrew Davison.\n- ADDED: Additional tests for the de facto Prolog standard format/2-3 predicates for the case where the number of arguments is larger than required by the format string."
    }
  ],
  "Version": "3.62.0",
  "ReleaseTime": "2023-01-31"
}
