{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.64.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- FIXED: Handling of dynamic/1 directives for predicates with no clauses in included files when using an include/1 argument in create_object/4 goals.\n- FIXED: Do not print a linter warning for a missing dynamic/1 directive when compiling a category if there isn't a scope directive for the predicate.\n- FIXED: Performance issue where the compiler would not inline predicate definitions when the clause body goal uses parameter variables.\nProlog adapter and integration files\n- CHANGED: The LVM adapter file to set the coinduction flag from the value of the unify_applies_occurs_check flag.\n- UPDATED: The LVM adapter file to expand calls to the open_db/2 built-in predicate from within objects and categories to ensure that all database predicates are visible.\n- UPDATED: All integration PowerShell scripts to require version 7.3 or later.\nLibrary\n- CHANGED: The csv library to throw error/2 exception terms and type-check the write_file/3 and write_stream/3 predicates.\n- ADDED: Experimental support for LVM to the java library.\n- ADDED: New java library array_to_list/2 and list_to_array/2 predicates. Unlike the now deprecated array_list/2 predicate, calls to these predicates can be inlined.\n- UPDATED: The java library to also abstract JPL jpl_map_element/2 and jpl_set_element/2 predicates for the SWI-Prolog and YAP backends.\n- FIXED: Description of the java library array_list/2 predicate.\nTools\n- CHANGED: The logtalk_tester.sh script to only accept LVM long options for choosing between the standard and custom top-levels.\n- CHANGED: The lgtunit tool clean_file/1 predicate to always interpret relative paths as relative to the tests object path. This simplifies usage and improves reliability by not depending on the current working directory.\n- ADDED: New packs::installed/1 predicate to list all packs installed from a given registry.\n- IMPROVED: The registries::update/0 predicate to inform the user when no registry is defined.\n- UPDATED: All tool PowerShell scripts to require version 7.3 or later.\n- FIXED: The logtalk_tester.sh and logtalk_tester.ps1 scripts passing calling options to a sourced tester.sh and tester.ps1 scripts in the test set directories.\n- FIXED: The logtalk_tester.ps1 script handling of the -w option to avoid warnings when the scratch directories don't exist.\nExamples\n- MOVED: Tests from the jpl example to the java library.\n- ADDED: New neo4j example of using the java library to interface with Neo4j.\n- ADDED: Tests for the document_converter example.\n- ADDED: Experimental support for LVM to the Java examples.\n- IMPROVED: Test set condition for the clustering example.\n- IMPROVED: The documentation of the bench example.\n- FIXED: The clustering and document_converter examples tester.sh scripts.\nTests\n- ADDED: Additional tests for the Prolog standard bagof/3, findall/3, setof/3, (\\+)/1, call/1-N, and once/1, predicates.\n- ADDED: Additional tests for the de facto Prolog standard findall/4, format/2-3, and setup_call_cleanup/3 predicates."
    }
  ],
  "Version": "3.64.0",
  "ReleaseTime": "2023-03-28"
}
