{
  "Installer": [
    {
      "InstallerUrl": "https://logtalk.org/files/logtalk-3.66.0.exe"
    }
  ],
  "Locale": [
    {
      "Locale": "en-US",
      "Key": "ReleaseNotes",
      "Value": "Logtalk compiler and runtime\n- ADDED: New parameter_variables, variable_names(Term), and singletons(Term) keys to the logtalk_load_context/2 built-in predicate.\n- ADDED: Two new meta-messages, [Stream,Prefix]>>Goal and [Stream]>>Goal, to the message printing mechanism. These new meta-messages allow calling a user-defined printing goal. The use of lambda expressions allow passing the message stream and prefix.\n- ADDED: Linter warning for predicates called as non-terminals from grammar rules.\n- ADDED: Linter warning for unclassified (but non-singleton and non-anonymous) variables in Free/Goal lambda expressions.\n- ADDED: Linter warning for object, predicate, and non-terminal aliases that are not distinct from the originals.\n- ADDED: Linter warning for (:)/2 goals when using a backend Prolog system that doesn't support modules and when not compiling a module as an object. Thanks to Lindsey Spratt for the suggestion.\n- ADDED: Linter warning for use_module/1-2 file directives when using a backend Prolog system that doesn't support modules.\n- ADDED: Linter warning for use_module/1-2 entity directives when using a backend Prolog system that doesn't support modules and not compiling a module as an object.\n- IMPROVED: Reporting of calls to undefined predicates and unknown predicates from auxiliary clauses (e.g. generated while compiling lambda expressions).\n- FIXED: Ensure that the startup library alias is found before the runtime constructed pack library aliases.\n- FIXED: Linter warning for unknown entities to only report unknown Prolog modules when the backend system actually support modules.\n- FIXED: Linter warning for unknown messages to only report calls to unknown Prolog module predicates when the backend system actually support modules.\nProlog adapter and integration files\n- UPDATED: The Trealla Prolog adapter file to require version 2.17.10 or later.\n- FIXED: The Quintus Prolog adapter file definition for the subsumes_term/2 standard predicate.\n- FIXED: The Scryer Prolog adapter filer to not declare module meta-predicates as built-in meta-predicates.\nDocumentation\n- ADDED: Handbook description and examples of the new meta-messages.\n- IMPROVED: Handbook documentation of the dynamic/0, include/1, and mode/2 directives.\n- IMPROVED: Handbook documentation of the logtalk_library_path/2 predicate.\n- IMPROVED: Handbook documentation on definite clause grammars.\n- IMPROVED: Handbook documentation on disjunctions and conditionals linter flags.\n- IMPROVED: Documentation of the packs tool on requirements plus saving and restoring (virtual) environments.\n- IMPROVED: Documentation of the linter, lgtunit, and tutor tools.\nLibrary\n- CHANGED: The hook_objects library loader file to only load the prolog_module_hook/1 object when running on a backend Prolog system supporting modules.\n- ADDED: New ulid library for generating Universally Unique Lexicographically Sortable Identifiers.\n- REMOVED: The term library object definition for the deprecated and no longer declared vars/2 predicate.\n- CHANGED: Declare the termp library protocol variables/2 predicate deprecated.\n- IMPROVED: Simplify the term library object variant/2 predicate.\n- UPDATED: The os library for LVM to use the new date_time/7 built-in predicate when available.\n- FIXED: Delete dead code in the the csv and statistics libraries.\nTools\n- IMPROVED: The dead_code_scanner tool no longer reports predicates listed in uses/2 or use_module/2 directives that are made available as scoped predicates by the object (or category) containing the directives.\n- IMPROVED: The dead_code_scanner tool no longer reports predicates defined in a complementing category when the complemented object contains or inherits a scope directive for the predicate.\n- IMPROVED: The tutor tool explanation for compiler errors when trying to redefine the meaning of predicates listed in uses/2 or use_module/2 directives.\n- UPDATED: The tutor tool to explain the new linter warnings.\n- UPDATED: The tutor tool to also explain the linter warning on missing else part in if-then-else and soft-cut control constructs.\n- FIXED: The packs tool describe/1-2 and directory/2 predicates when listing orphaned packs.\n- FIXED: Syntax error when loading the lgtdoc tool using the XSB backend.\n- FIXED: Bug in the validation code for the lgtdoc tool predicate entity_xsl_file and index_xsl_file options.\n- FIXED: Delete dead code in the the diagrams tool.\nExamples\n- IMPROVED: Documentation of the clustering, document_converter, and neo4j examples.\n- UPDATED: The errors example to illustrate lambda expression linter warnings and the new linter warnings.\n- UPDATED: The symbiosis example for Scryer Prolog.\n- FIXED: Example bench cases where predicates were called as non-terminals.\nTests\n- ADDED: Additional tests for the Prolog standard op/3, number_chars/2 and number_codes/2 predicates.\n- ADDED: Additional tests for the de facto Prolog standard numbervars/3 predicate.\n- FIXED: Test for the current_op/3 predicate (compliance with the ISO/IEC 13211-1:1995(E) standard, section 8.14.4.1 NOTES).\nContributions\n- UPDATED: Automate some of the xml_parser contribution original tests.\n- FIXED: Cases in the xml_parser contribution where predicates were called as non-terminals.\nInstallers and installation scripts\n- FIXED: The Windows installer to write the Logtalk version to the registry DisplayVersion property. Fix contributed by the GitHub user SpecterShell."
    }
  ],
  "Version": "3.66.0",
  "ReleaseTime": "2023-05-30"
}
